# PointReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyPointPlacementReference..::..PointReference Property
FamilyPointPlacementReference Class See Also
---
The reference on which the point depends on.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference PointReference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PointReference As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ PointReference {
	Reference^ get ();
}
```

# See Also
FamilyPointPlacementReference Class
Autodesk.Revit.DB Namespace